{
  "stack": "Стек",
  "footer": "Материалы используемые в кейсе взяты из:",

  "TvoyHit": {
    "title": "Музыкальный плеер для магазина песен Твой Хит",
    "desc": "Переработка логики работы стандартного каталога товаров Tilda в каталог музыкальных композиций и интеграция с кастомным аудио плеером.",
    "button": {
      "order": "Заказать для своего проекта",
      "site": "Посмотреть на сайте",
      "desc": "* полная интеграция модификации в ваш проект с использованием вашего дизайна."
    },
    "task": {
      "title": "Задача",
      "text": {
        "1": "Клиент уже пришел с готовым дизайном плеера в Zero-block. Стояло всего 2 задачи:",
        "2": "Улучшить стандартный дизайн каталога.",
        "3": "Реализовать функционал плеера."
      }
    },
    "dev": {
      "title": "Работа над проектом",
      "step1": {
        "title": "Шаг 1. Реконструкция элементов",
        "text": {
          "1": "Для того, чтобы начать работать над функционалом нужно было доделать скелет плеера. А точнее добавить ползунки громкости и музыки.",
          "2": "Для этой цели прекрасно подходят стандартные компоненты html в Zero-block."
        }
      },
      "step2": {
        "title": "Шаг 2. Работа со стилями",
        "text": {
          "1": "Тут как правило из-за ограничений Tilda в возможностях редактировать стили пришлось их переопределять.",
          "2": "Этот процесс не сложен, однако занимает тоже не малую часть времени."
        }
      },
      "step3": {
        "title": "Шаг 3. Работа над функционалом",
        "text": {
          "1": "Пришло время дать жизнь этому плееру и первым делом я запускаю VS Code. Так как этот инструмент мне во много раз понятнее чем Tilda.",
          "2": "Первым делом я определил все элементы с которыми я собираюсь работать. По большей части всё сводится к обычному document.querySelector.",
          "3": "Теперь предстояло расписать функционал. Для простоты разбил на отдельные функции каждое возможное действие.",
          "4": "После всех сценариев нужно было понять как скрестить это всё с каталогом. Просмотрев какие запросы приходят при взаимодействии с каталогом, понял что можно все это благополучно парсить. С 3 попытки вышло написать скрипт который спокойно получал бы список музыкальных треков из каталога.",
          "5": "Конечно, я еще раз 10-15 поправлял код, дорабатывая моменты которые не доглядел сразу. Однако в конечном итоге сдал полностью рабочий проект."
        }
      }
    },
    "final": {
      "title": "Финальный результат",
      "text": "покликать самому можно перейдя по ссылке в начале кейса"
    }
  }
}
